RIOT-OS/RIOT/cpu/esp32/include/periph_cpu.h
/*
 * Copyright (C) 2022 Gunar Schorcht
 *
 * This file is subject to the terms and conditions of the GNU Lesser
 * General Public License v2.1. See the file LICENSE in the top level
 * directory for more details.
 */

/**
 * @ingroup     cpu_esp32
 * @{
 *
 * @file
 * @brief       Peripheral configuration that is common for all ESP32x SoCs
 *
 * @author      Gunar Schorcht <gunar@schorcht.net>
 */

#ifndef PERIPH_CPU_H
#define PERIPH_CPU_H

#include <stdalign.h>
#include <stdbool.h>
#include <stdint.h>
#include "sdkconfig.h"
#include "hal/ledc_types.h"
#include "hal/spi_types.h"
#include "soc/ledc_struct.h"
#include "soc/periph_defs.h"
#include "soc/soc_caps.h"

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @brief   UART device used for STDIO
 */
#define STDIO_UART_DEV  CONFIG_ESP_CONSOLE_UART_NUM

/**
 * @name    Power management configuration
 * @{
 */
#define PROVIDES_PM_SET_LOWEST
#define PROVIDES_PM_RESTART
#define PROVIDES_PM_OFF
#define PROVIDES_PM_LAYERED_OFF

/**
 * @brief   Number of usable low power modes
 */
#define PM_NUM_MODES            (3U)

/**
 * @name    Power modes
 * @{
 */
#define ESP_PM_MODEM_SLEEP      (2U)
#define ESP_PM_LIGHT_SLEEP      (1U)
#define ESP_PM_DEEP_SLEEP       (0U)
/** @} */

/** @} */

/**
 * @brief   Length of the CPU_ID in octets
 */
#define CPUID_LEN               (6U)

/**
 * @name   GPIO configuration
 * @{
 */

/**
 * @brief   Override the default gpio_t type definition
 *
 * This is required here to have gpio_t defined in this file.
 * @{
 */
#define HAVE_GPIO_T
typedef unsigned int gpio_t;
/** @} */

/**
 * @brief   Definition of a fitting UNDEF value
 * @{
 */
#define GPIO_UNDEF          (0xffffffff)
/** @} */

/**
 * @brief   Define a CPU specific GPIO pin generator macro
 * @{
 */
#define GPIO_PIN(x, y)      ((x << 5) | y)
/** @} */

/**
 * @brief   Available GPIO ports on ESP32
 * @{
 */
#define PORT_GPIO           (0)
/** @} */

/**
 * @brief   Define CPU specific number of GPIO pins
 * @{
 */
#define GPIO_PIN_NUMOF      (SOC_GPIO_PIN_COUNT)
/** @} */

#ifndef DOXYGEN
/**
 * @brief   Override mode flank selection values
 *
 * @{
 */
#define HAVE_GPIO_FLANK_T
typedef enum {
    GPIO_NONE,
    GPIO_RISING,    /**< emit interrupt on rising flank  */
    GPIO_FALLING,   /**< emit interrupt on falling flank */
    GPIO_BOTH,      /**< emit interrupt on both flanks */
    GPIO_LOW,       /**< emit interrupt on low level */
    GPIO_HIGH       /**< emit interrupt on high level */
} gpio_flank_t;
/** @} */

/**
 * @brief   Override GPIO modes
 *
 * @{
 */
#define HAVE_GPIO_MODE_T
typedef enum {
    GPIO_IN,        /**< input */
    GPIO_IN_PD,     /**< input with pull-down */
    GPIO_IN_PU,     /**< input with pull-up */
    GPIO_OUT,       /**< output */
    GPIO_OD,        /**< open-drain output */
    GPIO_OD_PU,     /**< open-drain output with pull-up */
    GPIO_IN_OUT,    /**< input and output */
    GPIO_IN_OD,     /**< input and open-drain output */
    GPIO_IN_OD_PU   /**< input and open-drain output with pull-up */
} gpio_mode_t;
/** @} */

/* BEGIN: GPIO LL overwrites */

#if SOC_GPIO_PIN_COUNT > 32

#define GPIO_PORT_NUMOF         2
#define GPIO_PORT_0             0
#define GPIO_PORT_1             1
#define GPIO_PORT_0_PIN_NUMOF   (32)
#define GPIO_PORT_1_PIN_NUMOF   (SOC_GPIO_PIN_COUNT - 32)
#define GPIO_PORT_PIN_NUMOF(p)  ((p == GPIO_PORT_0) ? GPIO_PORT_0_PIN_NUMOF \
                                                    : GPIO_PORT_1_PIN_NUMOF)
#else

#define GPIO_PORT_NUMOF         1
#define GPIO_PORT_0             0
#define GPIO_PORT_0_PIN_NUMOF   (SOC_GPIO_PIN_COUNT)
#define GPIO_PORT_PIN_NUMOF(p)  ((p == GPIO_PORT_0) ? GPIO_PORT_0_PIN_NUMOF : 0)

#endif

#define HAVE_GPIO_PORT_T
typedef uintptr_t gpio_port_t;

#define HAVE_GPIO_SLEW_T
typedef enum {
    GPIO_SLEW_SLOWEST = 0,
    GPIO_SLEW_SLOW = 0,
    GPIO_SLEW_FAST = 0,
    GPIO_SLEW_FASTEST = 0,
} gpio_slew_t;

#define HAVE_GPIO_PULL_STRENGTH_T
typedef enum {
    GPIO_PULL_WEAKEST = 0,
    GPIO_PULL_WEAK = 0,
    GPIO_PULL_STRONG = 0,
    GPIO_PULL_STRONGEST = 0
} gpio_pull_strength_t;

#define HAVE_GPIO_PULL_T
typedef enum {
    GPIO_FLOATING = 0,
    GPIO_PULL_UP = 1,
    GPIO_PULL_DOWN = 2,
    GPIO_PULL_KEEP = 3   /*< not supported */
} gpio_pull_t;

/**
 * @brief   Current an output pin can drive in active and sleep modes
 */
#define HAVE_GPIO_DRIVE_STRENGTH_T
typedef enum {
    GPIO_DRIVE_WEAKEST   = 0,    /**<  5 mA */
    GPIO_DRIVE_WEAK      = 1,    /**< 10 mA */
    GPIO_DRIVE_STRONG    = 2,    /**< 20 mA (default) */
    GPIO_DRIVE_STRONGEST = 3,    /**< 30 mA */
} gpio_drive_strength_t;

/*
 * @brief   Map former enumeration values the new enumeration values for compatibility.
 */
#define GPIO_DRIVE_5    GPIO_DRIVE_WEAKEST      /**<  5 mA */
#define GPIO_DRIVE_10   GPIO_DRIVE_WEAK         /**< 10 mA */
#define GPIO_DRIVE_20   GPIO_DRIVE_STRONG       /**< 20 mA (default) */
#define GPIO_DRIVE_30   GPIO_DRIVE_STRONGEST    /**< 30 mA */

#define HAVE_GPIO_STATE_T
typedef enum {
    GPIO_OUTPUT_PUSH_PULL,
    GPIO_OUTPUT_OPEN_DRAIN,
    GPIO_OUTPUT_OPEN_SOURCE,
    GPIO_INPUT,
    GPIO_USED_BY_PERIPHERAL,
    GPIO_DISCONNECT,
} gpio_state_t;

#define HAVE_GPIO_CONF_T
typedef union gpio_conf_esp32 gpio_conf_t;

#endif /* ndef DOXYGEN */

/**
 * @brief       GPIO pin configuration for ESP32/ESP32Cx/ESP32Sx MCUs
 * @ingroup     drivers_periph_gpio_ll
 */
union gpio_conf_esp32 {
    uint8_t bits;  /**< the raw bits */
    struct {
        /**
         * @brief   State of the pin
         */
        gpio_state_t state                      : 3;
        /**
         * @brief   Pull resistor configuration
         */
        gpio_pull_t pull                        : 2;
        /**
         * @brief   Drive strength of the GPIO
         *
         * @warning If the requested drive strength is not available, the closest
         *          fit supported will be configured instead.
         *
         * This value is ignored when @ref gpio_conf_esp32::state is configured
         * to @ref GPIO_INPUT or @ref GPIO_DISCONNECT.
         */
        gpio_drive_strength_t drive_strength    : 2;
        /**
         * @brief   Initial value of the output
         *
         * Ignored if @ref gpio_conf_esp32::state is set to @ref GPIO_INPUT or
         * @ref GPIO_DISCONNECT. If the pin was previously in a high impedance
         * state, it is guaranteed to directly transition to the given initial
         * value.
         *
         * @ref gpio_ll_query_conf will write the current value of the specified
         * pin here, which is read from the input register when the state is
         * @ref GPIO_INPUT, otherwise the state from the output register is
         * consulted.
         */
        bool initial_value                      : 1;
    };
};

/* END: GPIO LL overwrites */
/** @} */

/**
 * @name   ADC configuration
 *
 * ESP32x SoCs integrate two SAR ADCs (ADC1 and ADC2). The bit width of the
 * ADC devices, the number of channels per device and the GPIOs that can be
 * used as ADC channels depend on the respective ESP32x SoC family. For
 * details, see:
 *
 * - \ref esp32_adc_channels_esp32 "ESP32"
 * - \ref esp32_adc_channels_esp32c3 "ESP32-C3"
 * - \ref esp32_adc_channels_esp32s3 "ESP32-S3"
 *
 * #ADC_GPIOS in the board-specific peripheral configuration defines the
 * list of GPIOs that can be used as ADC channels on the board, for example:
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~{.c}
 * #define ADC_GPIOS   { GPIO0, GPIO2, GPIO4 }
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 * Thereby the order of the listed GPIOs determines the mapping between the
 * ADC lines of the RIOT and the GPIOs. The maximum number of GPIOs in the
 * list is #ADC_NUMOF_MAX. The board specific configuration of #ADC_GPIOS
 * can be overridden by [Application specific configurations]
 * (#esp32_application_specific_configurations).
 *
 * The number of defined ADC channels #ADC_NUMOF is determined automatically
 * from the #ADC_GPIOS definition.
 *
 * @note As long as the GPIOs listed in #ADC_GPIOS are not initialized as ADC
 *       channels with the #adc_init function, they can be used for other
 *       purposes.
 *
 * With the function #adc_set_attenuation an attenuation of the input signal
 * can be defined separately for each ADC channel.
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~{.c}
 * extern int adc_set_attenuation(adc_t line, adc_attenuation_t atten);
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 * This leads to different measurable maximum values for the voltage at the input.
 * The higher the attenuation is, the higher the voltage measured at the input
 * can be.
 *
 * The attenuation can be set to 4 fixed values 0 dB, 2.5/3 dB, 6 dB and
 * 11/12 dB, where 11 dB respectively 12 dB is the default attenuation.
 *
 * <center>
 *
 * Attenuation | Voltage Range     | Symbol
 * -----------:|-------------------|---------------------------
 *       0 dB  | 0 ... 1.1V (Vref) | `ADC_ATTEN_DB_0`
 * 2.5 / 3 dB  | 0 ... 1.5V        | `ADC_ATTEN_DB_2_5`
 *       6 dB  | 0 ... 2.2V        | `ADC_ATTEN_DB_6`
 * 11 / 12 dB  | 0 ... 3.3V        | `ADC_ATTEN_DB_11` (default)
 *
 * </center><br>
 *
 * @note The reference voltage Vref can vary from device to device in the range
 *       of 1.0V and 1.2V.
 *
 * The Vref of a device can be read at a predefined GPIO with the function
 * #adc_line_vref_to_gpio. The results of the ADC input can then be adjusted
 * accordingly.
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~{.c}
 * extern int adc_line_vref_to_gpio(adc_t line, gpio_t gpio);
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * For the GPIO that can be used with this function, see:
 *
 * - \ref esp32_adc_channels_esp32 "ESP32"
 * - \ref esp32_adc_channels_esp32c3 "ESP32-C3"
 * - \ref esp32_adc_channels_esp32s3 "ESP32-S3"
 *
 * @{
 */

/**
 * @brief  Number of ADC channels that could be used at maximum
 */
#define ADC_NUMOF_MAX   (SOC_ADC_CHANNEL_NUM(0) + SOC_ADC_CHANNEL_NUM(1))

/** @} */

/**
 * @name   DAC configuration
 *
 * Some ESP32x SoCs support 2 DAC lines at predefined GPIOs, depending on the
 * respective ESP32x SoC family. These DACs have a width of 8 bits and produce
 * voltages in the range from 0 V to 3.3 V (VDD_A). The 16 bit DAC values
 * given as parameter of function #dac_set are down-scaled to 8 bit.
 *
 * The GPIOs that can be used as DAC channels for a given board are defined by
 * the `#DAC_GPIOS` macro in the board-specific peripheral configuration.
 * The specified GPIOs in the list must match the predefined GPIOs that can be
 * used as DAC channels on the respective ESP32x SoC.
 *
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~{.c}
 * #define DAC_GPIOS   { GPIO25, GPIO26 }
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 * This configuration can be changed by [application-specific configurations]
 * (#esp32_application_specific_configurations).
 *
 * The order of the listed GPIOs determines the mapping between the RIOT's
 * DAC lines and the GPIOs. The maximum number of GPIOs in the list is
 * #DAC_NUMOF_MAX.
 *
 * #DAC_NUMOF is determined automatically from the #DAC_GPIOS definition.
 *
 * @note As long as the GPIOs listed in #DAC_GPIOS are not initialized
 * as DAC channels with the #dac_init function, they can be used for other
 * purposes.
 *
 * DACs are currently only supported for the \ref esp32_dac_channels_esp32
 * "ESP32 SoC" variant.
 *
 * @{
 */

/**
 * @brief  Number of DAC channels that could be used at maximum.
 */
#if defined(SOC_DAC_SUPPORTED) || DOXYGEN
#define DAC_NUMOF_MAX   (SOC_DAC_PERIPH_NUM)
#endif

/** @} */

/**
 * @name   I2C configuration
 *
 * ESP32x SoCs integrate up to two I2C hardware interfaces.
 *
 * The board-specific configuration of the I2C interface I2C_DEV(n) requires
 * the definition of
 *
 * `I2Cn_SPEED`, the bus speed for I2C_DEV(n),
 * `I2Cn_SCL`, the GPIO used as SCL signal for I2C_DEV(n), and
 * `I2Cn_SDA`, the GPIO used as SDA signal for I2C_DEV(n),
 *
 * where `n` can be 0 or 1. If they are not defined, the I2C interface
 * I2C_DEV(n) is not used, for example:
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~{.c}
 * #define I2C0_SPEED  I2C_SPEED_FAST
 * #define I2C0_SCL    GPIO22
 * #define I2C0_SDA    GPIO21
 *
 * #define I2C1_SPEED  I2C_SPEED_NORMAL
 * #define I2C1_SCL    GPIO13
 * #define I2C1_SDA    GPIO16
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 * The board-specific pin configuration of I2C interfaces can be changed by
 * [application specific configurations](#esp32_application_specific_configurations)
 * by overriding the according `I2Cn_*` symbols.
 *
 * @note
 * - To ensure that the `I2Cn_*` symbols define the configuration for
 *   I2C_DEV(n), the definition of the configuration of I2C interfaces
 *   I2C_DEV(n) must be in continuous ascending order of `n`.
 *   That is, if I2C_DEV(1) is used by defining the `I2C1_*` symbols,
 *   I2C_DEV(0) must also be used by defining the `I2C0_*` symbols.
 * - The GPIOs listed in the configuration are only initialized as I2C
 *   signals when the `periph_i2c` module is used. Otherwise they are not
 *   allocated and can be used for other purposes.
 * - The same configuration is used when the I2C bit-banging software
 *   implementation is used by enabling module `esp_i2c_sw` (default).
 *
 * The number of used I2C interfaces #I2C_NUMOF is determined automatically
 * from board-specific peripheral definitions of I2C_DEV(n).
 *
 * @{
 */

#ifndef DOXYGEN
/**
 * @brief    Override I2C clock speed values
 *
 * This is required here to have i2c_speed_t defined in this file.
 * @{
 */
#define HAVE_I2C_SPEED_T
typedef enum {
    I2C_SPEED_LOW = 0,      /**< 10 kbit/s */
    I2C_SPEED_NORMAL,       /**< 100 kbit/s */
    I2C_SPEED_FAST,         /**< 400 kbit/s */
    I2C_SPEED_FAST_PLUS,    /**< 1 Mbit/s */
    I2C_SPEED_HIGH,         /**< not supported */
} i2c_speed_t;
/** @} */
#endif /* ndef DOXYGEN */

/**
 * @brief   I2C configuration structure type
 */
typedef struct {
    uint8_t module;         /**< I2C module identifier */
    i2c_speed_t speed;      /**< I2C bus speed */
    gpio_t scl;             /**< GPIO used as SCL pin */
    gpio_t sda;             /**< GPIO used as SDA pin */
    bool scl_pullup;        /**< Pullup enabled for SCL pin */
    bool sda_pullup;        /**< Pullup enabled for SDA pin */
} i2c_conf_t;

/**
 * @brief   Maximum number of I2C interfaces that can be used by board definitions
 */
#define I2C_NUMOF_MAX   (SOC_I2C_NUM)

#define PERIPH_I2C_NEED_READ_REG    /**< Implementation requires #i2c_read_reg */
#define PERIPH_I2C_NEED_READ_REGS   /**< Implementation requires #i2c_read_regs */
#define PERIPH_I2C_NEED_WRITE_REG   /**< Implementation requires #i2c_write_reg */
#define PERIPH_I2C_NEED_WRITE_REGS  /**< Implementation requires #i2c_write_regs */
/** @} */

/**
 * @name   PWM configuration
 *
 * The PWM peripheral driver for ESP32x SoCs uses the LED PWM Controller (LEDC)
 * module for implementation. The LEDC module has either 1 or 2 channel groups
 * with 6 or 8 channels each, where the first channel group comprises the
 * low-speed channels and the second channel group comprises the high-speed
 * channels. The difference is that changes in the configuration of the
 * high-speed channels take effect with the next PWM cycle, while the changes
 * in the configuration of the low-speed channels must be explicitly updated
 * by a trigger.
 *
 * The low-speed channel group always exists while the existence of the
 * high-speed channel group depends on respective ESP32x SoC family.
 *
 * Each channel group has 4 timers which can be used as clock source by the
 * channels of the respective channel group. Thus it would be possible to
 * define a maximum of 4 virtual PWM devices in RIOT per channel group with
 * different frequencies and resolutions. However, regardless of whether the
 * LEDC module of the ESP32x SoC has one or two channel groups, the PWM driver
 * implementation only allows the available channels to be organized into
 * up to 4 virtual PWM devices.
 *
 * The assignment of the available channels to the virtual PWM devices is
 * done in the board-specific peripheral configuration by defining the
 * macros `PWM0_GPIOS`, `PWM1_GPIOS`, `PWM2_GPIOS` and `PWM3_GPIOS` These
 * macros specify the GPIOs that are used as channels for the 4 possible
 * virtual PWM devices PWM_DEV(0) ... PWM_DEV(3) in RIOT, for example:
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~{.c}
 * #define PWM0_GPIOS  { GPIO0, GPIO2, GPIO4, GPIO16, GPIO17 }
 * #define PWM1_GPIOS  { GPIO27, GPIO32, GPIO33 }
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 * This configuration can be changed by [application-specific configurations]
 * (#esp32_application_specific_configurations).
 *
 * The mapping of the GPIOs as channels of the available channel groups and
 * channel group timers is organized by the driver automatically as follows:
 *
 * <center>
 *
 * Macro        | 1 Channel Group       | 2 Channel Groups       | Timer
 * -------------|-----------------------|------------------------|---------------
 * `PWM0_GPIOS` | `LEDC_LOW_SPEED_MODE` | `LEDC_LOW_SPEED_MODE`  | `LEDC_TIMER_0`
 * `PWM1_GPIOS` | `LEDC_LOW_SPEED_MODE` | `LEDC_HIGH_SPEED_MODE` | `LEDC_TIMER_1`
 * `PWM2_GPIOS` | `LEDC_LOW_SPEED_MODE` | `LEDC_LOW_SPEED_MODE`  | `LEDC_TIMER_2`
 * `PWM3_GPIOS` | `LEDC_LOW_SPEED_MODE` | `LEDC_HIGH_SPEED_MODE` | `LEDC_TIMER_3`
 *
 * </center>
 *
 * For example, if the LEDC module of the ESP32x SoC has two channel groups,
 * two virtual PWM devices with 2 x 6 (or 8) channels could be used by defining
 * 'PWM0_GPIOS' and 'PWM1_GPIOS' with 6 (or 8) GPIOs each.
 *
 * The number of used PWM devices #PWM_NUMOF is determined automatically from the
 * definition of `PWM0_GPIOS`, `PWM1_GPIOS`, `PWM2_GPIOS` and `PWM3_GPIOS`.
 *
 * @note
 * - The total number of channels defined for a channel group must not exceed
 *   #PWM_CH_NUMOF_MAX
 * - The definition of `PWM0_GPIOS`, `PWM1_GPIOS`, `PWM2_GPIOS` and
 *   `PWM3_GPIOS` can be omitted. However, to ensure that `PWMn_GPIOS` defines
 *   the configuration for PWM_DEV(n), the PWM channels must be defined in
 *   continuous ascending order from `n`. That means, if `PWM1_GPIOS` is
 *   defined, `PWM0_GPIOS` must be defined before, and so on. So a minimal
 *   configuration would define all channels by `PWM0_GPIOS` as PWM_DEV(0).
 * - The order of the GPIOs in these macros determines the mapping between
 *   RIOT's PWM channels and the GPIOs.
 * - As long as the GPIOs listed in `PWM0_GPIOS`, `PWM1_GPIOS`,
 *   `PWM2_GPIOS` and `PWM3_GPIOS` are not initialized as PWM channels with
 *   the #pwm_init function, they can be used for other purposes.
 *
 * @{
 */

/**
 * @brief   PWM configuration structure type
 *
 * The implementation of the PWM peripheral driver uses the LED PWM Controller
 * (LEDC) module of the ESP32x SoC. The LEDC module has up to 2 channel groups
 * with 6 or 8 channels each, which can use one of 4 timers.
 *
 * Based on these maximum 2 channel groups with 6 or 8 channels each and 4
 * timers, up to 4 PWM devices can be configured in RIOT. The configuration
 * structure defines static parameters for each virtual PWM device, i.e.
 * the channel group used, the timer used, the number of channels used and
 * the GPIOs assigned to the channels. The number of channels used by a PWM
 * device corresponds to the number of GPIOs assigned to this PWM device.
 */
typedef struct {
    uint8_t module;         /**< LEDC module identifier */
    ledc_mode_t group;      /**< LEDC channel group used (low/high speed) */
    ledc_timer_t timer;     /**< LEDC timer used by this device */
    uint8_t ch_numof;       /**< Number of channels used by this device */
    const gpio_t *gpios;    /**< GPIOs used as channels of this device */
} pwm_config_t;

/**
 * @brief   Maximum number of PWM devices
 */
#define PWM_NUMOF_MAX       (4)

/**
 * @brief   Maximum number of channels per PWM device.
 */
#define PWM_CH_NUMOF_MAX    (SOC_LEDC_CHANNEL_NUM)

/** @} */

/**
 * @name    RMT configuration
 *
 * ESP32x SoCs have a Remote Control Peripheral (RMT) that can be used to
 * generate digital waveforms, such as NEC remote control signals or
 * WS2812B RGB LED signals. Each RMT peripheral has either 4 or 8 channels.
 * Some ESP32x SoCs support configuring the clock sources used for each channel
 * separately, while other ESP32x SoCs can only use a single clock source for
 * all channels.
 *
 * @{
 */

/**
 * @brief   RMT channel configuration
 *
 * Each RMT channel is mapped to a GPIO. The configured mappings are used
 * by the drivers that use the RMT peripheral to determine the RMT channel
 * for a given GPIO.
 */
typedef struct {
    uint8_t channel;    /**< channel index */
    gpio_t gpio;        /**< GPIO used as RMT channel */
} rmt_channel_config_t;

/**
 * @brief   Maximum number of RMT channels
 *
 * The number of configured channels must be less or equal.
 */
#define RMT_CH_NUMOF_MAX    (SOC_RMT_CHANNELS_PER_GROUP)

/** @} */

/**
 * @name    RNG configuration
 * @{
 */

/**
 * @brief   The address of the register for accessing the hardware RNG.
 */
#define RNG_DATA_REG_ADDR   (WDEV_RND_REG)
/** @} */

/**
 * @name    RTT and RTC configuration
 * @{
 */

/**
 * @brief   RTT frequency definition
 *
 * The RTT frequency is always 32.768 kHz even if no external crystal is
 * connected. In this case the RTT value counted with the internal 150 kHz
 * RC oscillator is converted to a value for an RTT with 32.768 kHz.
 */
#define RTT_FREQUENCY       (32768UL)

/**
 * @brief   RTT is a 32-bit counter
 */
#define RTT_MAX_VALUE       (0xFFFFFFFFUL)

/** @} */

/**
 * @name   SDMMC configuration
 *
 * ESP32x SoC with SDMMC peripheral provide two SDMMC interfaces called slots.
 * How many slots can be used depends on the ESP32x SoC, see @ref sdmmc_slot_t.
 *
 * @{
 */
/**
 * @brief  SDIO/SDMMC slots
 *
 * ESP32x SoCs that have a SDMMC peripheral provide two SDMMC interfaces called
 * slots.
 *
 * @note If the ESP32x variant uses direct I/O functions for the SDMMC signals
 *       (i.e. `SOC_SDMMC_USE_IOMUX` is defined in SoC capabilities), the
 *       GPIOs used for the SDMMC slots are fixed. In this case, slot 0
 *       can't be used because the GPIOs are defined for Slot 0 are the
 *       same as those used for the Flash. If the ESP32x variant uses
 *       the GPIO matrix to route the SDMMC signals to arbitrary pins
 *       (i.e. `SOC_SDMMC_USE_GPIO_MATRIX` is defined in SoC capabilities),
 *       slot 0 can be used but the GPIOs used for the slot have to be
 *       different from those used for the Flash.
 */
typedef enum {
#if IS_USED(SOC_SDMMC_USE_GPIO_MATRIX) || DOXYGEN
    SDMMC_SLOT_0 = 0,   /**< SD/MMC host controller slot 0 (not usable on ESP32 variant) */
#endif
    SDMMC_SLOT_1 = 1,   /**< SD/MMC host controller slot 1 */
} sdmmc_slot_t;

