RIOT-OS/RIOT/cpu/esp32/include/periph_cpu.h
/**
 * @brief   SDMMC slot configuration
 *
 * If the ESP32x variant uses the GPIO matrix to route the SDMMC signals
 * to arbitrary pins (i.e. `SOC_SDMMC_USE_GPIO_MATRIX` is defined in SoC
 * capabilities file), the pins must be configured. The bus width is then
 * determined from the defined pins. Define the pins for the DAT lines
 * as `GPIO_UNDEF` to use a smaller data bus width.
 * If the ESP32x variant uses direct I/O (i.e. `SOC_SDMMC_USE_IOMUX` is
 * defined in SoC capabilities file), the bus width has to be specified instead.
 */
typedef struct {
    sdmmc_slot_t slot;  /**< SDMMC slot used [ SDMMC_SLOT_0 | SDMMC_SLOT_1] */
    gpio_t cd;          /**< Card Detect pin (must be GPIO_UNDEF if not connected) */
    gpio_t wp;          /**< Write Protect pin (must be GPIO_UNDEF if not connected) */
#if IS_USED(SOC_SDMMC_USE_GPIO_MATRIX) || DOXYGEN
    gpio_t clk;         /**< CLK pin (must be defined) */
    gpio_t cmd;         /**< CMD pin (must be defined) */
    gpio_t dat0;        /**< DAT[0] pin (must be defined) */
    gpio_t dat1;        /**< DAT[1] pin (GPIO_UNDEF if not connected) */
    gpio_t dat2;        /**< DAT[2] pin (GPIO_UNDEF if not connected) */
    gpio_t dat3;        /**< DAT[3] pin (GPIO_UNDEF if not connected) */
#if IS_USED(MODULE_PERIPH_SMMC_8BIT) || DOXYGEN
    gpio_t dat4;        /**< DAT[4] pin (GPIO_UNDEF if not connected) */
    gpio_t dat5;        /**< DAT[5] pin (GPIO_UNDEF if not connected) */
    gpio_t dat6;        /**< DAT[6] pin (GPIO_UNDEF if not connected) */
    gpio_t dat7;        /**< DAT[7] pin (GPIO_UNDEF if not connected) */
#endif /* IS_USED(MODULE_PERIPH_SMMC_8BIT) */
#else /* IS_USED(SOC_SDMMC_USE_IOMUX) */
    uint8_t bus_width;  /**< Bus width */
#endif
} sdmmc_conf_t;

/**
 * @brief  SDIO/SDMMC buffer instantiation requirement for SDHC
 */
#define SDMMC_CPU_DMA_REQUIREMENTS  alignas(SDMMC_CPU_DMA_ALIGNMENT)

/**
 * @brief  SDIO/SDMMC buffer alignment for SDHC because of DMA/FIFO buffer restrictions
 */
#define SDMMC_CPU_DMA_ALIGNMENT     4

/** @} */

/**
 * @name   SPI configuration
 *
 * ESP32x SoCs have up to four SPI controllers dependent on the specific ESP32x
 * SoC variant (family):
 *
 * - Controller SPI0 is reserved for caching external memory like Flash
 * - Controller SPI1 is reserved for external memories like PSRAM
 * - Controller SPI2 can be used as general purpose SPI (GPSPI)
 * - Controller SPI3 can be used as general purpose SPI (GPSPI)
 *
 * The controllers SPI0 and SPI1 share the same bus signals and can only
 * operate in memory mode on most ESP32x SoC variants. Therefore, depending on
 * the specific ESP32x SoC family, a maximum of two SPI controllers can be used
 * as peripheral interfaces:
 *
 * - Controller SPI2 is identified by `SPI2_HOST` (also called FSPI or HSPI)
 * - Controller SPI3 is identified by `SPI3_HOST` (also called VSPI)
 *
 * In former ESP-IDF versions, SPI interfaces were identified by the alias
 * names `FSPI`, `HSPI` and `VSPI`, which are sometimes also used in data
 * sheets. These alias names have been declared obsolete in ESP-IDF. For
 * source code compatibility reasons these alias names are defined here.
 *
 * SPI interfaces could be used in quad SPI mode, but RIOT's low level
 * device driver doesn't support it.
 *
 * The board-specific configuration of the SPI interface SPI_DEV(n) requires
 * the definition of
 *
 * - `SPIn_CTRL`, the SPI controller (`SPI_HOST2`/`SPI_HOST3`) used for SPI_DEV(n),
 * - `SPIn_SCK`, the GPIO used as clock signal used for SPI_DEV(n)
 * - `SPIn_MISO`, the GPIO used as MISO signal used for SPI_DEV(n)
 * - `SPIn_MOSI`, the GPIO used as MOSI signal used for SPI_DEV(n), and
 * - `SPIn_CS0`, the GPIO used as CS signal for SPI_DEV(n) when the `cs`
 *   parameter in #spi_acquire is #GPIO_UNDEF,
 *
 * where `n` can be 0 and 1. If they are not defined, the according SPI
 * interface SPI_DEV(n) is not used, for example:
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~{.c}
 * #define SPI0_CTRL   SPI3_HOST   // VSPI could also be used on ESP32 variant
 * #define SPI0_SCK    GPIO18      // SCK  signal
 * #define SPI0_MISO   GPIO19      // MISO signal
 * #define SPI0_MOSI   GPIO23      // MOSI signal
 * #define SPI0_CS0    GPIO5       // CS0  signal
 *
 * #define SPI1_CTRL   SPI2_HOST   // HSPI could also be used here on ESP32 variant
 * #define SPI1_SCK    GPIO14      // SCK  Camera
 * #define SPI1_MISO   GPIO12      // MISO Camera
 * #define SPI1_MOSI   GPIO13      // MOSI Camera
 * #define SPI1_CS0    GPIO15      // CS0  Camera
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 * The pin configuration of SPI interfaces can be changed by
 * [application specific configurations](#esp32_application_specific_configurations)
 * by overriding the according `SPIn_*` symbols.
 *
 * @note
 * - To ensure that the `SPIn_*` symbols define the configuration for
 *   SPI_DEV(n), the definition of the configuration of SPI interfaces
 *   SPI_DEV(n) must be in continuous ascending order of `n`.
 *   That is, if SPI_DEV(1) is used by defining the `SPI1_*` symbols,
 *   SPI_DEV(0) must also be used by defining the `SPI0_*` symbols.
 * - The order in which the available interfaces `SPI2_HOST` (alias `HSPI` or
 *   `FSPI`) and `SPI3_HOST` (alias `VPSI` or `HSPI`) are assigned doesn't matter.
 * - The GPIOs listed in the configuration are only initialized as SPI
 *   signals when the `periph_spi` module is used. Otherwise they are not
 *   allocated and can be used for other purposes.
 *
 * #SPI_NUMOF is determined automatically from the board-specific peripheral
 * configuration for SPI_DEV(n).
 *
 * @{
 */

#ifndef DOXYGEN
/**
 * @brief    Override SPI clock speed values
 * @{
 */
#define HAVE_SPI_CLK_T
typedef enum {
    SPI_CLK_100KHZ = 100000,            /**< drive the SPI bus with 100KHz */
    SPI_CLK_400KHZ = 400000,            /**< drive the SPI bus with 400KHz */
    SPI_CLK_1MHZ   = 1000000,           /**< drive the SPI bus with 1MHz */
    SPI_CLK_5MHZ   = 5000000,           /**< drive the SPI bus with 5MHz */
    SPI_CLK_10MHZ  = 10000000           /**< drive the SPI bus with 10MHz */
} spi_clk_t;
/** @} */

/**
 * @brief   SPI pin getters
 * @{
 */
#define spi_pin_mosi(dev) spi_config[dev].mosi
#define spi_pin_miso(dev) spi_config[dev].miso
#define spi_pin_clk(dev)  spi_config[dev].sck
/** @} */

#endif /* !DOXYGEN */

/**
 * @brief   Mapping of SPI controller type for source code compatibility
 */
typedef spi_host_device_t spi_ctrl_t;

